
cask_args appdir: '/Applications'

tap 'caskroom/homebrew-cask' || true

# Install Java
tap 'AdoptOpenJDK/openjdk'
cask 'adoptopenjdk11'
cask 'adoptopenjdk8'

# Install CLI tools
brew 'git'
brew 'wsk'
brew 'groovy'
brew 'jq'
brew 'azure-cli'
brew 'helm'
brew 'kubernetes-cli'
brew 'bash-completion'
brew 'htop'
brew 'lynx'
brew 'node'
brew 'repo'
brew 'tree'
brew 'maven'
brew 'siege'
brew 'vim'
brew 'gnupg'
brew 'wget'
brew 'jenv'
brew 'minikube'

# Install Casks
cask 'cyberduck'
cask 'franz'
cask 'keka'
cask 'opera'
cask 'vagrant'
cask 'docker'
cask 'imageoptim'
cask 'meld'
cask 'spotify'
cask 'ccleaner'
cask 'postman'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'eclipse-jee'
cask 'ngrok'
cask 'shiftit'
cask 'tableau-public'
